import { Context } from 'telegraf';

export async function handleInstructions(ctx: Context) {
  const text = 
    `☕️ <b>የቡና ቢንጎ የጨዋታ ህጎች (Buna Bingo Rules)</b>\n\n` +
    
    `<b>🎴 የመጫወቻ ካርድ</b>\n` +
    `• ጨዋታውን ለመጀመር ከሚመጡልን ከ1-100 የመጫወቻ ካርድ ውስጥ አንዱን እንመርጣለን።\n` +
    `• የመጫወቻ ካርዱ ላይ በቀይ ቀለም የተመረጡ ቁጥሮች የሚያሳዩት ካርዱ በሌላ ተጫዋች መመረጡን ነው።\n` +
    `• የመጫወቻ ካርዱን ስንነካው ከታች በኩል የካርድ ቁጥሩን እና ይዘቱን ያሳየናል።\n` +
    `• የምንፈልገውን ካርድ ከመረጥን በኋላ ከታች መሃል ላይ <b>Play</b> የሚለውን በመንካት ወደ ጨዋታው እንገባለን።\n` +
    `• <b>Active Game</b> የሚለው የሚያሳየን አሁን ላይ እየተካሄዱ ያሉ የጨዋታ ብዛቶችን ነው።\n\n` +

    `<b>🎮 ጨዋታ</b>\n` +
    `• ወደ ጨዋታው ስንገባ በመረጥነው የካርድ ቁጥር መሰረት የመጫወቻ ካርድ እናገኛለን።\n` +
    `• የመጀመሪያ ተጫዋች ከሆንን ከላይ በቀኝ በኩል <b>Wait</b> የሚል ጽሁፍ እናገኛለን።\n` +
    `• ተጨማሪ ተጫዋቾች ሲገቡ ጨዋታው ለመጀመር ያለውን ቀሪ ሴኮንድ መቁጠር ይጀምራል።\n` +
    `• ጨዋታው ሲጀምር ከ1 እስከ 75 ያሉ ቁጥሮች መጥራት ይጀምራል።\n` +
    `• የሚጠራው ቁጥር የእኛ ካርድ ውስጥ ካለ ቁጥሩን በመንካት መምረጥ እንችላለን።\n` +
    `• የመረጥነውን ቁጥር ማጥፋት ከፈለግን መልሰን ቁጥሩን በመንካት ማጥፋት እንችላለን።\n\n` +

    `<b>🏆 አሸናፊ</b>\n` +
    `• ቁጥሮቹ ሲጠሩ ወደ ጎን፣ ወደ ታች፣ አግዳሚ ወይም አራቱን ማእዘናት ከሞላን ወዲያውኑ <b>BINGO</b> የሚለውን በመንካት ማሸነፍ እንችላለን።\n` +
    `• ህጉ ሳይሞላ <b>BINGO</b> የሚለውን ክሊክ ካደረግን ከጨዋታው እንባረራለን።\n` +
    `• ሁለት ተጫዋቾች እኩል ቢያሸንፉ ቀድሞ <b>BINGO</b> ያለው ተጫዋች አሸናፊ ይሆናል።\n` +
    `• ጨዋታው ውስጥ ከገባን በኋላ ሌላ ተጫዋች ካልገባ <b>Leave</b> የሚለውን በመንካት መውጣት እንችላለን።\n\n` +
    
    `☕️ <i>Buna Bingo: The Royal Way to Win!</i>`;

  await ctx.reply(text, { parse_mode: 'HTML' });
}
